#include<stdio.h>
#include<Windows.h>
using namespace std;
char inf1[20] = { 'А','л','ю','м','и','н','и','й' }, inf2[20] = { 'В','и','с','м','у','т' }, inf3[20] = {'С','в','и','н','е','ц'};
int num1=13, num2=83, num3=82;
int temp1 = 700, temp2 = 304, temp3 = 441;
float v1 = 2.9, v2 = 1.65, v3 = 2.11;
int main() {

	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	printf("1. Введите вещество, атомный номер, температуру (град С) и вязкость (кг/м*сек): ");
	//scanf_s("%8c %d %d %f", &inf1, 8, &num1, &temp1, v1);

	printf("2. Введите вещество, атомный номер, температуру (град С) и вязкость (кг/м*сек): ");
	//scanf_s("%6c %d %d %f", &inf2, 6, &num2, &temp2, v2);

	printf("3. Введите вещество, атомный номер, температуру (град С) и вязкость (кг/м*сек): ");
	//scanf_s("%6c %d %d %f", &inf3, 6, &num3, &temp3, v3);
	printf("-----------------------------------------------------------------------------------------");
	printf("| Вязкость металлов в жидком состоянии                                                  |");
	printf("-----------------------------------------------------------------------------------------");
	printf("| Вещество     | Атомный номер    |   Температура (град.С)     |     Вязкость (кг/м*сек)|");
	printf("|--------------|------------------|----------------------------|------------------------|");
}	printf("| %c                | %d                  | %d        | %.2f     |", inf1, num1, temp1, v1);